org-info/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-07 Mon 15:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org19caf87">1. emacs使用心得</a>
<ul>
<li><a href="#org499e0ad">1.1. why  &#x2013; 为什么使用emacs</a></li>
<li><a href="#orgfa95057">1.2. what &#x2013; emacs是什么</a></li>
<li><a href="#org8fde0bb">1.3. how  &#x2013; 如何使用</a></li>
</ul>
</li>
<li><a href="#orga778816">2. emacs基础操作</a>
<ul>
<li><a href="#orgcedf630">2.1. frame基础</a></li>
<li><a href="#org28f8a49">2.2. Helm</a></li>
<li><a href="#orgba62c36">2.3. org mode</a></li>
<li><a href="#org2b869bb">2.4. eshell</a></li>
<li><a href="#org7d4d5ca">2.5. 画图</a></li>
<li><a href="#org542912e">2.6. 快捷键</a></li>
<li><a href="#org1e8a00f">2.7. elisp</a></li>
<li><a href="#orgf38844d">2.8. tramp</a>
<ul>
<li><a href="#org817951a">2.8.1. 基本用法</a></li>
<li><a href="#org7e3c8f0">2.8.2. 设置默认method</a></li>
<li><a href="#org47861b6">2.8.3. 多级跳转</a></li>
<li><a href="#org1db4342">2.8.4. 以sudo方式打开file</a></li>
<li><a href="#org10c9ffc">2.8.5. 注意事项</a></li>
<li><a href="#orga5c18ed">2.8.6. tramp alist</a></li>
</ul>
</li>
<li><a href="#org9696b05">2.9. 快速选择窗口</a></li>
<li><a href="#orgc7109d6">2.10. 查找</a>
<ul>
<li><a href="#org7d78323">2.10.1. 当前buffer查找 isearch，helm-occur</a></li>
<li><a href="#org685993f">2.10.2. 任意目录中查找</a></li>
<li><a href="#org626c04b">2.10.3. 工程中查找</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org48662b4">3. emacs打造IDE</a>
<ul>
<li><a href="#orgea7b174">3.1. 说明</a></li>
<li><a href="#org27e0d21">3.2. 合格的IDE功能</a></li>
<li><a href="#orgaf3f799">3.3. 编辑器</a></li>
<li><a href="#org560d37e">3.4. 编译器</a></li>
<li><a href="#org620003f">3.5. 调试器</a></li>
</ul>
</li>
<li><a href="#orge339207">4. emacs奇淫技巧</a>
<ul>
<li><a href="#org09feef6">4.1. figlet</a>
<ul>
<li><a href="#orgd5a5116">4.1.1. 安装</a></li>
<li><a href="#org5726f73">4.1.2. 配置</a></li>
<li><a href="#org0fccb18">4.1.3. 使用</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org231d520">5. emacs键位设置</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19caf87" class="outline-2">
<h2 id="org19caf87"><span class="section-number-2">1</span> emacs使用心得</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org499e0ad" class="outline-3">
<h3 id="org499e0ad"><span class="section-number-3">1.1</span> why  &#x2013; 为什么使用emacs</h3>
<div class="outline-text-3" id="text-1-1">
<p>
下面只是自己的理由
</p>
<ol class="org-ol">
<li>项目管理 &amp;&amp; 日常工作计划               &#x2013; org-mode处理(主要使用了org-agent特性)</li>
<li>blog写作                               &#x2013; org-mode处理(org本身是非常优秀的文本模式)</li>
<li>bash(shell) 环境                       &#x2013; eshell非常优秀</li>
<li>coding 类c语言(c, c++)                 &#x2013; 使用emacs作为IDE</li>
<li>coding 其他语言 (go,lisp, &#x2026;)         &#x2013; 虽然不如专业的开发软件，但emacs胜在方便快捷</li>
</ol>
</div>
</div>

<div id="outline-container-orgfa95057" class="outline-3">
<h3 id="orgfa95057"><span class="section-number-3">1.2</span> what &#x2013; emacs是什么</h3>
<div class="outline-text-3" id="text-1-2">
<p>
emacs更像是一个可扩展的框架, 需要什么功能，扩展一下即可(添加package)
</p>
</div>
</div>

<div id="outline-container-org8fde0bb" class="outline-3">
<h3 id="org8fde0bb"><span class="section-number-3">1.3</span> how  &#x2013; 如何使用</h3>
<div class="outline-text-3" id="text-1-3">
<p>
这里只是复述自己如何打造自己的emacs
</p>

<ol class="org-ol">
<li>定制外在样式
<ul class="org-ul">
<li>frame的定制, init-frame</li>
<li>font的定制,  init-font</li>
<li>字符编码,    init-encode</li>
<li>主题定制,    dracula-theme</li>
</ul></li>
<li>package管理
init-site-lisp &amp;&amp; init-elpa</li>
<li>内在优化
<ul class="org-ul">
<li>buffer, file显示优化, init-helm-mode</li>
<li>智能匹配（[], {}, '', ""&#x2026;),  init-smartparens-mode</li>
<li>模板文件,     init-yasnippet-mode</li>
<li>文本区域选择, init-expand-region</li>
<li>windos选择,   init-window-number</li>
</ul></li>
<li>常用功能
<ul class="org-ul">
<li>书签     init-bookmark</li>
<li>eshell   init-eshell</li>
<li>search   init-search</li>
<li>tramp    init-tramp</li>
</ul></li>
<li>常用mode
<ul class="org-ul">
<li>org</li>
<li>c-comon IDE</li>
</ul></li>
<li>快捷键管理
<ul class="org-ul">
<li>鼠标管理, init-disable-mouse</li>
<li>快捷键,   init-local-shortkey, init-global-shortkey</li>
</ul></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orga778816" class="outline-2">
<h2 id="orga778816"><span class="section-number-2">2</span> emacs基础操作</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcedf630" class="outline-3">
<h3 id="orgcedf630"><span class="section-number-3">2.1</span> frame基础</h3>
<div class="outline-text-3" id="text-2-1">
<p>
建议frame只显示window, mode-line
</p>
<ul class="org-ul">
<li>window是我们操作(write, read)的区域
重要的是window的创建，切换 和 删除</li>
<li>mode-line 补充显示buffer的其他信息,以及mode信息，也非常重要</li>
</ul>
</div>
</div>

<div id="outline-container-org28f8a49" class="outline-3">
<h3 id="org28f8a49"><span class="section-number-3">2.2</span> Helm</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="emacs_com/emacs_helm-mode.html">Helm</a>改善了用户"查找"时候的体验;
helm与传统方式 对比:
</p>
<ul class="org-ul">
<li>Helm的过滤方式为 正则表达式</li>
<li>传统的过滤方式为 首字母扩展</li>
</ul>
</div>
</div>
<div id="outline-container-orgba62c36" class="outline-3">
<h3 id="orgba62c36"><span class="section-number-3">2.3</span> org mode</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<a href="emacs_com/emacs_org-mode.html">org-mode</a>一直被称为神器, 据传很多人为了它转到了emacs.
主要功能:
</p>
<ul class="org-ul">
<li>org自身强大的文本模式</li>
<li>org-agent</li>
</ul>
</div>
</div>

<div id="outline-container-org2b869bb" class="outline-3">
<h3 id="org2b869bb"><span class="section-number-3">2.4</span> eshell</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="emacs_com/emacs_eshell.html">eshell</a>是emacs下非常好用shell;
主要优点:
</p>
<ul class="org-ul">
<li>与elisp的无缝结合</li>
<li><p>
语法特性方面比bash shell更有意思
</p>
<pre class="example">
cd /ssh:clay@192.168.0.97:~
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-org7d4d5ca" class="outline-3">
<h3 id="org7d4d5ca"><span class="section-number-3">2.5</span> 画图</h3>
<div class="outline-text-3" id="text-2-5">
<p>
emacs支持 <a href="emacs_com/emacs_graphviz-mode.html">ASCII图形 和 dot图形等</a>
</p>
</div>
</div>
<div id="outline-container-org542912e" class="outline-3">
<h3 id="org542912e"><span class="section-number-3">2.6</span> 快捷键</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<a href="emacs_com/emacs_shortkey.html">emacs按键</a>与vim按键 个人理解:
</p>
<ul class="org-ul">
<li>emacs功能强大, 却对手指不友好,  更适合在编辑的时候使用</li>
<li>vim 功能缺少, 对手指友好, 更适合在查看文档的时候使用</li>
</ul>
</div>
</div>
<div id="outline-container-org1e8a00f" class="outline-3">
<h3 id="org1e8a00f"><span class="section-number-3">2.7</span> elisp</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<a href="emacs_com/emacs_elisp.html">elisp</a> 是emacs下的lisp
</p>
</div>
</div>
<div id="outline-container-orgf38844d" class="outline-3">
<h3 id="orgf38844d"><span class="section-number-3">2.8</span> tramp</h3>
<div class="outline-text-3" id="text-2-8">
<p>
全程 transparent remote access multiple protocol
tramp是用来编辑远端文件的模块
支持多种协议 ssh, ftp, smb, adb等, 常用method
</p>
<ul class="org-ul">
<li>ssh</li>
<li>plink putty的ssh client(与linux的ssh client作用一样)</li>
<li><p>
su  这种并不连接到远程主机, 而是允许使用另一个用户身份打开本地文件
</p>
<pre class="example">
/su:root:path/
</pre></li>
<li>sudo 同上</li>
</ul>
</div>

<div id="outline-container-org817951a" class="outline-4">
<h4 id="org817951a"><span class="section-number-4">2.8.1</span> 基本用法</h4>
<div class="outline-text-4" id="text-2-8-1">
<pre class="example">
/method:user@host#port:path/to/file
# example 1 
/ssh:clay@192.1.1.1#22:~
# example 2 windows下可以使用putty作为ssh的client
/plink:clay@192.1.1.1:~
</pre>
</div>
</div>
<div id="outline-container-org7e3c8f0" class="outline-4">
<h4 id="org7e3c8f0"><span class="section-number-4">2.8.2</span> 设置默认method</h4>
<div class="outline-text-4" id="text-2-8-2">
<pre class="example">
(setq tramp-default-method "plink")

; 设置之后的例子. 优点在于可以不需要考虑window和linux环境
/-:clay@192.1.1.1:~
</pre>
</div>
</div>
<div id="outline-container-org47861b6" class="outline-4">
<h4 id="org47861b6"><span class="section-number-4">2.8.3</span> 多级跳转</h4>
<div class="outline-text-4" id="text-2-8-3">
<pre class="example">
/ssh:clay@host1|ssh:admin@host2:/path

# 在本机上,    通过clay用户登录到host1
# 再在host1上, 通过admin登录到host2    
</pre>
</div>
</div>
<div id="outline-container-org1db4342" class="outline-4">
<h4 id="org1db4342"><span class="section-number-4">2.8.4</span> 以sudo方式打开file</h4>
<div class="outline-text-4" id="text-2-8-4">
<pre class="example">
# 使用sudo打开远程文件
/-:clay@192.1.1.1|sudo::/path
# 使用sudo打开本地文件
# su::默认的是 su:root@localhost. 配置在tramp-default-method-alist
/su::local-path
/su:user@localhost:/local-path
/sudo:root@localhost:/local-path
</pre>
</div>
</div>
<div id="outline-container-org10c9ffc" class="outline-4">
<h4 id="org10c9ffc"><span class="section-number-4">2.8.5</span> 注意事项</h4>
<div class="outline-text-4" id="text-2-8-5">
<p>
Tramp 打开的远端文件和本地的文件没什么区别，
会被记录在 backup、autosave、recentf 等中。
在今后重启 Emacs 时，如果这时无法连接远端机器，Emacs 可能会卡住，
这是因为 tramp 会对之前打开的文件进行检查
</p>

<p>
解决方案:
让backup等机制绕过tramp即可
</p>
</div>
</div>
<div id="outline-container-orga5c18ed" class="outline-4">
<h4 id="orga5c18ed"><span class="section-number-4">2.8.6</span> tramp alist</h4>
<div class="outline-text-4" id="text-2-8-6">
<p>
tramp使用的时候 需要使用到method user host path的组合，一般较长
我们更希望使用较短的shortcut去远程打开某个file
这里推荐的方法是bookmark. 理由:
</p>
<ol class="org-ol">
<li>bookmark emacs内置, 而且非常方便</li>
<li>bookmark 的配置信息 可以方便git管理</li>
</ol>


<p>
使用方法:
</p>
<pre class="example">
# 1.远程连接
C-x f /ssh:clay@192.1.1.1:~
# 2.添加到bookmark
C-x C-f BOOK-NAME RET
# 3.查看bookmark
C-x C-f
# 4.管理bookmark配置文件
~/.emacs.d/bookmarks
# 5.管理auth信息文件
~/.emacs.d/authinfo
</pre>
</div>
</div>
</div>
<div id="outline-container-org9696b05" class="outline-3">
<h3 id="org9696b05"><span class="section-number-3">2.9</span> 快速选择窗口</h3>
<div class="outline-text-3" id="text-2-9">
<p>
mode: switch-window
快捷键
</p>
<ol class="org-ol">
<li>C-x o &#x2013; switch-window 当window数量超过2个, 会使用快捷键选择窗口</li>
<li><p>
当处于C-x o窗口选择状态时候, 可以通过快捷键改变windows布局
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">i</td>
<td class="org-left">move the border up</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">k</td>
<td class="org-left">move the border down</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">j</td>
<td class="org-left">move the border left</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">l</td>
<td class="org-left">move the border right</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-left">balance windows</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SPC</td>
<td class="org-left">resume auto-resize</td>
</tr>
</tbody>
</table></li>
</ol>
</div>
</div>
<div id="outline-container-orgc7109d6" class="outline-3">
<h3 id="orgc7109d6"><span class="section-number-3">2.10</span> 查找</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org7d78323" class="outline-4">
<h4 id="org7d78323"><span class="section-number-4">2.10.1</span> 当前buffer查找 isearch，helm-occur</h4>
</div>
<div id="outline-container-org685993f" class="outline-4">
<h4 id="org685993f"><span class="section-number-4">2.10.2</span> 任意目录中查找</h4>
<div class="outline-text-4" id="text-2-10-2">
<ul class="org-ul">
<li><p>
find-grep
实际是linux下的find+grep组合, 所以依赖linux下的find和grep命令
如果是windows系统, 需要下载GnuWin32，并配置emacs认识他
</p>
<pre class="example">
# exp1: 在当前目录下的所有文件中(含递归目录) 查找字符串'emacs'
find . -type f |xargs grep -n emacs
</pre></li>
<li><p>
eshell/grep &#x2013; 仅在eshell-mode下生效
使用eshell(emacs内置)的grep
</p>
<pre class="example">
# TODO 待补充详细用法
# 用法 grep 搜索内容 正则式(搜索目录)
# 在当前目录的文件中 查找字符串'emacs'
grep emacs *
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-org626c04b" class="outline-4">
<h4 id="org626c04b"><span class="section-number-4">2.10.3</span> 工程中查找</h4>
<div class="outline-text-4" id="text-2-10-3">
<p>
TODO 待补充 整理emacs作为IDE的时候再整理
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org48662b4" class="outline-2">
<h2 id="org48662b4"><span class="section-number-2">3</span> emacs打造IDE</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgea7b174" class="outline-3">
<h3 id="orgea7b174"><span class="section-number-3">3.1</span> 说明</h3>
<div class="outline-text-3" id="text-3-1">
<p>
本文很大程度借鉴<a href="http://tuhdo.github.io/c-ide.html">参考文档(强烈建议阅读)</a>
</p>
</div>
</div>
<div id="outline-container-org27e0d21" class="outline-3">
<h3 id="org27e0d21"><span class="section-number-3">3.2</span> 合格的IDE功能</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>编辑
所想即所得的编辑模式</li>
<li>编译</li>
<li>调试</li>
<li>发布</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf3f799" class="outline-3">
<h3 id="orgaf3f799"><span class="section-number-3">3.3</span> 编辑器</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">mode</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">格式规范</td>
<td class="org-left"><a href="emacs_IDE/emacs_cc-mode.html">cc-mode</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">自动补全</td>
<td class="org-left"><a href="emacs_IDE/emacs_company-mode.html">company-mode</a>(front-ends)</td>
<td class="org-left">需要back-ends</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">company-c-headers(back-ends)</td>
<td class="org-left">针对头文件,直接安装即可使用,无需配置</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">智能括号</td>
<td class="org-left"><a href="emacs_IDE/emacs_smartparens-mode.html">smartparens-mode</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">代码折叠</td>
<td class="org-left"><a href="emacs_IDE/emacs_hs-mode.html">hs-minor-mode</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">模板文件</td>
<td class="org-left"><a href="emacs_IDE/emacs_yasnippet-mode.html">yasnippet-mode</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">代码跳转</td>
<td class="org-left"><a href="emacs_IDE/emacs_helm-gtags-mode">helm-gtags-mode</a>(front-ends)</td>
<td class="org-left">需要back-ends</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">查找引用</td>
<td class="org-left">global(back-ends)</td>
<td class="org-left">apt install global</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">拼写检查</td>
<td class="org-left"><a href="emacs_IDE/emacs_flyspell-mode.html">flyspell-mode</a></td>
<td class="org-left">单词拼写</td>
<td class="org-left">已弃用</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">语法检查</td>
<td class="org-left">flycheck-mode</td>
<td class="org-left">动态,实时检查</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">目录列表</td>
<td class="org-left"><a href="emacs_IDE/emacs_speedbar-mode.html">speedbar-mode</a></td>
<td class="org-left">显示目录,文件</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">语法高亮</td>
<td class="org-left">symbol-overlay-mode</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org560d37e" class="outline-3">
<h3 id="org560d37e"><span class="section-number-3">3.4</span> 编译器</h3>
<div class="outline-text-3" id="text-3-4">
<p>
compilation-mode
</p>
<pre class="example">
front-ends, 依赖g++

</pre>
</div>
</div>

<div id="outline-container-org620003f" class="outline-3">
<h3 id="org620003f"><span class="section-number-3">3.5</span> 调试器</h3>
<div class="outline-text-3" id="text-3-5">
<p>
gud
</p>
</div>
</div>
</div>

<div id="outline-container-orge339207" class="outline-2">
<h2 id="orge339207"><span class="section-number-2">4</span> emacs奇淫技巧</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org09feef6" class="outline-3">
<h3 id="org09feef6"><span class="section-number-3">4.1</span> figlet</h3>
<div class="outline-text-3" id="text-4-1">
<p>
把字符艺术化
emacs中的figlet package是front-end,
依赖shell环境的back-ends figlet
</p>
</div>

<div id="outline-container-orgd5a5116" class="outline-4">
<h4 id="orgd5a5116"><span class="section-number-4">4.1.1</span> 安装</h4>
<div class="outline-text-4" id="text-4-1-1">
<ol class="org-ol">
<li><p>
bash中安装back-ends
</p>
<pre class="example">
brew install figlet
</pre></li>
<li><p>
emacs中安装front-ends
</p>
<pre class="example">
package-list-package RET figlet RET
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org5726f73" class="outline-4">
<h4 id="org5726f73"><span class="section-number-4">4.1.2</span> 配置</h4>
<div class="outline-text-4" id="text-4-1-2">
<ol class="org-ol">
<li><p>
figlet默认路径
</p>
<pre class="example">
setq figlet-default-directory "/usr/local/bin"
</pre></li>
<li><p>
默认艺术字体
</p>
<pre class="example">
setq figlet-default-font "banner3-D"
</pre>

<p>
已安装的字体可以在bash中通过showfigfonts查看   
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org0fccb18" class="outline-4">
<h4 id="org0fccb18"><span class="section-number-4">4.1.3</span> 使用</h4>
<div class="outline-text-4" id="text-4-1-3">
<pre class="example">
M-x figlet RET &lt;string&gt; RET
</pre>

<pre class="example">
# '########:'##::::'##::::'###:::::'######:::'######::
#  ##.....:: ###::'###:::'## ##:::'##... ##:'##... ##:
#  ##::::::: ####'####::'##:. ##:: ##:::..:: ##:::..::
#  ######::: ## ### ##:'##:::. ##: ##:::::::. ######::
#  ##...:::: ##. #: ##: #########: ##::::::::..... ##:
#  ##::::::: ##:.:: ##: ##.... ##: ##::: ##:'##::: ##:
#  ########: ##:::: ##: ##:::: ##:. ######::. ######::
# ........::..:::::..::..:::::..:::......::::......:::
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org231d520" class="outline-2">
<h2 id="org231d520"><span class="section-number-2">5</span> emacs键位设置</h2>
<div class="outline-text-2" id="text-5">
<p>
原则
</p>
<ol class="org-ol">
<li>尽量保留默认常用快捷键</li>
<li>不同mode, 尽量使用相似的快捷键</li>
</ol>


<p>
思路
</p>
<ol class="org-ol">
<li>通用快捷键(比如search等与mode无关的) 或者是 所有mode都会使用的(比如yas)
统一放到C-s中</li>
<li>mode自身的快捷键, 放到C-j中</li>
<li>因为使用hydra来管理快捷键, 因此可以通过查看hydra body 来查看快捷键设置</li>
</ol>


<p>
方案
</p>
<ol class="org-ol">
<li>C-s
查找, 查找全部, 替换, 替换全部
跳转行号
查看模板, 添加模板</li>
<li>C-j
symbol-overlay &#x2013; 所有coding都会开启
helm-gtas      &#x2013; cc-mode中开启
smart-parents  &#x2013; 所有coding都会开启
org-mode</li>
</ol>


<p>
问题
</p>
<ol class="org-ol">
<li>symbol-overlay, smartparens, helm-gtags会有冲突
解决方案
<ul class="org-ul">
<li class="on"><code>[X]</code> <p>
开启helm-gtags的时候, hydra-helm-gtags覆盖symbol-overlay
</p>
<pre class="example">
使用remapping commands

</pre></li>
<li class="off"><code>[&#xa0;]</code> smart-parents 使用另外一个快捷键 (这里是妥协的做法, 不是最好的)</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-11-07 Mon 15:45</p>
<p class="validation"></p>
</div>
</body>
</html>
